## ðŸ“ŒDATAFRAME OPERASYONLARI VE PÄ°VOT TABLE

In [77]:
import pandas as pd
import numpy as np

In [78]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","AyÅŸe","Murat","Zeynep"]
})

In [79]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     AyÅŸe
4        5      300    Murat
5        6      100   Zeynep

In [80]:
df.head()

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     AyÅŸe
4        5      300    Murat

In [81]:
df["Column2"].unique() # Colum2'de bulunan benzersiz elemanlar listesi

array([100, 200, 300], dtype=int64)

In [82]:
df["Column2"].nunique() # Benzersiz eleman sayÄ±sÄ±

3

In [83]:
df["Column2"].value_counts() # Column2'de bulunan elemanlarÄ±n her birinin sayÄ±sÄ±

Column2
100    3
300    2
200    1
Name: count, dtype: int64

In [84]:
df[(df["Column1"] > 2) & (df["Column2"] == 300)]  #Column1'de   3'ten bÃ¼yÃ¼k ve Column2'de 300 olan elemanlar

   Column1  Column2 Column3
3        4      300    AyÅŸe
4        5      300   Murat

In [85]:
def times3(x): # her deÄŸeri 3 ile Ã§arpan func.
    return x * 3

In [86]:
df["Column2"].apply(times3) #times3 Func uygulayalÄ±m

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [87]:
df["Column3"].apply(len) #colum3'de bulunan Strignlerin karakter uzunluklarÄ±

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [88]:
#times3 fonksiyonunu lambda ile de uygulayabililiriz

df["Column2"].apply(lambda x : x * 2 )

0    200
1    200
2    400
3    600
4    600
5    200
Name: Column2, dtype: int64

In [89]:
df.drop("Column1",axis = 1,inplace = True) # Column1 sÃ¼tununu sil.(axis =1 ise sÃ¼tun siler ve inplace = true ile deÄŸiÅŸkiliÄŸi kalÄ±cÄ± hale getiriyoruz )

In [90]:
df

   Column2  Column3
0      100  Mustafa
1      100    Kamil
2      200     Emre
3      300     AyÅŸe
4      300    Murat
5      100   Zeynep

In [91]:
df.columns #Kontrol sonunda Column1 silindi.

Index(['Column2', 'Column3'], dtype='object')

In [92]:
df.index # index 0 - 6 arasÄ± var

RangeIndex(start=0, stop=6, step=1)

In [93]:
df.index.names

FrozenList([None])

In [94]:
len(df.index.names)

1

In [95]:
#Ã–RNEK:
import pandas as pd

# Ã‡ok dÃ¼zeyli (MultiIndex) bir DataFrame oluÅŸturma
arrays = [['A', 'A', 'B', 'B'], ['X', 'Y', 'X', 'Y']]
index = pd.MultiIndex.from_arrays(arrays, names=('Outer', 'Inner'))
dff = pd.DataFrame({'Data': [1, 2, 3, 4]}, index=index)

# Ä°ndeks adlarÄ±nÄ± alma
print(dff.index.names)  # Ã‡Ä±ktÄ±: FrozenList(['Outer', 'Inner'])

# Ä°ndeks adlarÄ±nÄ±n uzunluÄŸunu bulma
print("Len Ä°ndex: " , len(dff.index.names))  # Ã‡Ä±ktÄ±: 2

['Outer', 'Inner']
Len Ä°ndex:  2

In [96]:
df

   Column2  Column3
0      100  Mustafa
1      100    Kamil
2      200     Emre
3      300     AyÅŸe
4      300    Murat
5      100   Zeynep

In [120]:
df.sort_values("Column2") #column2 verilerini sÄ±ralÄ± ÅŸekilde  dÃ¼zenle

   Column2  Column3
0      100  Mustafa
1      100    Kamil
5      100   Zeynep
2      200     Emre
3      300     AyÅŸe
4      300    Murat

In [122]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","MayÄ±s","Mart","Nisan","MayÄ±s","Mart","Nisan","MayÄ±s"],
    "Åžehir":["Ankara","Ankara","Ankara","Ä°stanbul","Ä°stanbul","Ä°stanbul","Ä°zmir","Ä°zmir","Ä°zmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [124]:
df

      Ay     Åžehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  MayÄ±s    Ankara   50
3   Mart  Ä°stanbul   21
4  Nisan  Ä°stanbul   67
5  MayÄ±s  Ä°stanbul   80
6   Mart     Ä°zmir   30
7  Nisan     Ä°zmir   70
8  MayÄ±s     Ä°zmir   75

```python 
df.pivot_table(index="Åžehir", columns="Ay", values="Nem")

```

ifadesi, pandas DataFrame'inde belirtilen sÃ¼tunlarÄ± kullanarak bir ``pivot`` tablo oluÅŸturur. ``Pivot tablo, veriyi Ã¶zetlemek ve gruplamak iÃ§in kullanÄ±lÄ±r.``
Bu iÅŸlem, belirli bir sÃ¼tun (veya sÃ¼tunlar) ile gruplandÄ±rma yaparak, veriyi daha anlamlÄ± ve derli toplu bir ÅŸekilde dÃ¼zenler.

ðŸ‘‡Parametreler:

``index:`` Pivot tablonun satÄ±rlarÄ±na yerleÅŸtirilecek olan sÃ¼tun adÄ± veya sÃ¼tun adlarÄ±. Burada ***index="Åžehir"*** olarak belirtilmiÅŸ, bu da her bir ÅŸehrin ayrÄ± bir satÄ±rda temsil edileceÄŸi anlamÄ±na gelir.

``columns:`` Pivot tablonun sÃ¼tunlarÄ±na yerleÅŸtirilecek olan sÃ¼tun adÄ± veya sÃ¼tun adlarÄ±. Burada ***columns="Ay"*** olarak belirtilmiÅŸ, bu da her bir ayÄ±n ayrÄ± bir sÃ¼tunda gÃ¶sterileceÄŸi anlamÄ±na gelir.

``values:`` HesaplamalarÄ±n yapÄ±lacaÄŸÄ± (genellikle sayÄ±sal) sÃ¼tun adÄ±. Burada ***values="Nem"*** olarak belirtilmiÅŸ, bu da her ÅŸehre ve aya karÅŸÄ± gelen nem deÄŸerlerinin hesaplanacaÄŸÄ± sÃ¼tunudur.

In [132]:
df.pivot_table(index = "Åžehir",columns ="Ay",values = "Nem")

Ay        Mart  MayÄ±s  Nisan
Åžehir
Ankara    10.0   50.0   25.0
Ä°stanbul  21.0   80.0   67.0
Ä°zmir     30.0   75.0   70.0

In [140]:
df.pivot_table(index = "Ay",columns ="Åžehir",values = "Nem")

Åžehir  Ankara  Ä°stanbul  Ä°zmir
Ay
Mart     10.0      21.0   30.0
MayÄ±s    50.0      80.0   75.0
Nisan    25.0      67.0   70.0

In [142]:
df

      Ay     Åžehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  MayÄ±s    Ankara   50
3   Mart  Ä°stanbul   21
4  Nisan  Ä°stanbul   67
5  MayÄ±s  Ä°stanbul   80
6   Mart     Ä°zmir   30
7  Nisan     Ä°zmir   70
8  MayÄ±s     Ä°zmir   75